#### FluidDensity Property

---

|  |
| --- |
| PipeFittingAndAccessoryData Class   See Also |

The fluid density of the pipe fitting or pipe accessory, Units: (kg/ftÂ³).

**Namespace:**   Autodesk.Revit.DB.Plumbing
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public double FluidDensity { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property FluidDensity As Double 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property double FluidDensity { 	double get (); } ``` |

# See Also

PipeFittingAndAccessoryData Class

Autodesk.Revit.DB.Plumbing Namespace